### It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?
##### Take this monstrosity as the DataFrame to use in the following puzzles:
 df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [166]:
import pandas as pd
import numpy as np

In [167]:
 df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [168]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [169]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [170]:
# Checking Null Values:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [171]:
# Trying to find the indexes of Null values:
arr = np.where(df['FlightNumber'].isnull()==True)
arr

(array([1, 3], dtype=int64),)

In [172]:
type(arr)

tuple

In [173]:
# Since arr is tuple, therefore accessing the first element of tuple i.e. accessing only array
for i in arr[0]:
    print(i)

1
3

In [174]:
# df.loc[Row, column]
# df.loc[3,'FlightNumber']

In [175]:
# Replacing NUll values with increment of 10 in previous value: using the indexes we found in arr!
for i in arr[0]:
    df.loc[i,'FlightNumber'] = df.loc[i-1,'FlightNumber']+10

In [176]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [177]:
# Changing Datatype to int from float:
df=df.astype({'FlightNumber':int})

In [178]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [179]:
# Second way to change datatype:
df['FlightNumber'] = df['FlightNumber'].apply(lambda a: int(a))

In [180]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [181]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [182]:
temporarydf = df.copy()

In [183]:
lst1= []
lst2 = []
for i in temporarydf['From_To']:
    temp = i.split('_')
    lst1.append(temp[0])
    lst2.append(temp[1])

In [184]:
lst1

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [185]:
lst2

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [186]:
temporarydf['From'] = pd.DataFrame(lst1)
temporarydf['To'] = pd.DataFrame(lst2)
temporarydf

# OR: temporarydf[['From','To']] = temporarydf.From_To.str.split('_', expand = True)

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [187]:
# Original df remains same:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [188]:
temporarydf['From'] = temporarydf['From'].apply(lambda a: a.title())
# OR : temporarydf['From'] = temporarydf['From'].str.capitalize()
# OR : temporaryd.From = temporarydf.From.str.capitalize()

In [189]:
temporarydf['To'] = temporarydf['To'].apply(lambda a: a.title())

In [190]:
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

## 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [195]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [198]:
df.drop('From_To', axis=1, inplace=True)

In [200]:
# After dropping
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [204]:
new = pd.concat([df, temporarydf.From, temporarydf.To], axis=1)

In [205]:
new

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [285]:
 df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [286]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [287]:
rows = []
_ = df.apply(lambda row:[rows.append([row['From_To'], row['FlightNumber'], nn, row['Airline']]) for nn in row.RecentDelays], axis=1)

In [288]:
rows

[['LoNDon_paris', 10045.0, 23, 'KLM(!)'],
 ['LoNDon_paris', 10045.0, 47, 'KLM(!)'],
 ['londON_StockhOlm', 10065.0, 24, '(British Airways. )'],
 ['londON_StockhOlm', 10065.0, 43, '(British Airways. )'],
 ['londON_StockhOlm', 10065.0, 87, '(British Airways. )'],
 ['Budapest_PaRis', nan, 13, '12. Air France'],
 ['Brussels_londOn', 10085.0, 67, '"Swiss Air"'],
 ['Brussels_londOn', 10085.0, 32, '"Swiss Air"']]

In [289]:
rows_df = pd.DataFrame(rows, columns = df.columns)

In [290]:
rows_df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0            23               KLM(!)
1      LoNDon_paris       10045.0            47               KLM(!)
2  londON_StockhOlm       10065.0            24  (British Airways. )
3  londON_StockhOlm       10065.0            43  (British Airways. )
4  londON_StockhOlm       10065.0            87  (British Airways. )
5    Budapest_PaRis           NaN            13       12. Air France
6   Brussels_londOn       10085.0            67          "Swiss Air"
7   Brussels_londOn       10085.0            32          "Swiss Air"

### 6. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [291]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [272]:
df["RecentDelays"].values.tolist()

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [274]:
delays = pd.DataFrame(df['RecentDelays'].values.tolist(), columns = ['delay_1','delay_2','delay_3'])

In [292]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [293]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [294]:
# Dropping RecentDelay from Original DF:
df.drop('RecentDelays', axis=1, inplace=True)

In [299]:
# Adding delay Df to Original Df:
df = pd.concat([df,delays], axis=1)

# OR: df[['Delay 1','Delay 2','Delay 3']] = delays[['delay_1','delay_2','delay_3']]

In [300]:
df

,From_To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,LoNDon_paris,10045.0,KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,NaN,<Air France> (12),NaN,NaN,NaN
2,londON_StockhOlm,10065.0,(British Airways. ),24.0,43.0,87.0
3,Budapest_PaRis,NaN,12. Air France,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"""Swiss Air""",67.0,32.0,NaN